nxp-appcodehub/an-lvgl_demo_for_small_mcu/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : I2C3_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void I2C1_InitPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    IOCON->PIO[0][13] =
        ((IOCON->PIO[0][13] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_OD_MASK | IOCON_PIO_SSEL_MASK | IOCON_PIO_FILTEROFF_MASK | IOCON_PIO_ECS_MASK)))

         /* Selects pin function.
          * : PORT013 (pin 46) is configured as FC1_RXD_SDA_MOSI_DATA. */
         | IOCON_PIO_FUNC(PIO0_13_FUNC_ALT5)

         /* Selects function mode (on-chip pull-up/pull-down resistor control).
          * : Inactive.
          * Inactive (no pull-down/pull-up resistor enabled). */
         | IOCON_PIO_MODE(PIO0_13_MODE_INACTIVE)

         /* Driver slew rate.
          * : Standard-mode, output slew rate is slower.
          * More outputs can be switched simultaneously. */
         | IOCON_PIO_SLEW(PIO0_13_SLEW_STANDARD)

         /* Input polarity.
          * : Disabled.
          * Input function is not inverted. */
         | IOCON_PIO_INVERT(PIO0_13_INVERT_DISABLED)

         /* Select Digital mode.
          * : Enable Digital mode.
          * Digital input is enabled. */
         | IOCON_PIO_DIGIMODE(PIO0_13_DIGIMODE_DIGITAL)

         /* Controls open-drain mode in standard GPIO mode (EGP = 1).
          * This bit has no effect in I2C mode (EGP=0).
          * : Normal.
          * Normal push-pull output. */
         | IOCON_PIO_OD(PIO0_13_OD_NORMAL)

         /* Supply Selection bit.
          * : 3V3 Signaling in I2C Mode. */
         | IOCON_PIO_SSEL(PIO0_13_SSEL_SEL3V3)

         /* Controls input glitch filter.
          * : Filter disabled. */
         | IOCON_PIO_FILTEROFF(PIO0_13_FILTEROFF_DISABLED)

         /* Pull-up current source enable in I2C mode.
          * : Disabled.
          * IO is in open drain cell. */
         | IOCON_PIO_ECS(PIO0_13_ECS_DISABLED));

    IOCON->PIO[0][14] =
        ((IOCON->PIO[0][14] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_OD_MASK | IOCON_PIO_SSEL_MASK | IOCON_PIO_FILTEROFF_MASK | IOCON_PIO_ECS_MASK)))

         /* Selects pin function.
          * : PORT014 (pin 47) is configured as FC1_TXD_SCL_MISO_WS. */
         | IOCON_PIO_FUNC(PIO0_14_FUNC_ALT6)

         /* Selects function mode (on-chip pull-up/pull-down resistor control).
          * : Inactive.
          * Inactive (no pull-down/pull-up resistor enabled). */
         | IOCON_PIO_MODE(PIO0_14_MODE_INACTIVE)

         /* Driver slew rate.
          * : Standard-mode, output slew rate is slower.
          * More outputs can be switched simultaneously. */
         | IOCON_PIO_SLEW(PIO0_14_SLEW_STANDARD)

         /* Input polarity.
          * : Disabled.
          * Input function is not inverted. */
         | IOCON_PIO_INVERT(PIO0_14_INVERT_DISABLED)

         /* Select Digital mode.
          * : Enable Digital mode.
          * Digital input is enabled. */
         | IOCON_PIO_DIGIMODE(PIO0_14_DIGIMODE_DIGITAL)

         /* Controls open-drain mode in standard GPIO mode (EGP = 1).
          * This bit has no effect in I2C mode (EGP=0).
          * : Normal.
          * Normal push-pull output. */
         | IOCON_PIO_OD(PIO0_14_OD_NORMAL)

         /* Supply Selection bit.
          * : 3V3 Signaling in I2C Mode. */
         | IOCON_PIO_SSEL(PIO0_14_SSEL_SEL3V3)

         /* Controls input glitch filter.
          * : Filter disabled. */
         | IOCON_PIO_FILTEROFF(PIO0_14_FILTEROFF_DISABLED)

         /* Pull-up current source enable in I2C mode.
          * : Disabled.
          * IO is in open drain cell. */
         | IOCON_PIO_ECS(PIO0_14_ECS_DISABLED));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
I2C3_DeinitPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : I2C3_DeinitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void I2C1_DeinitPins(void)
{
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
